리버스 프록시와 로드밸런서는
시스템의 역할이 비슷하기 때문에 혼동할 수 있습니다.
여기에서는 차이점에 대해서 알아보겠습니다.

# 리버스 프록시
리버스 프록시는 클라이언트의 Request을 받아 들여
URI에 따라 시스템의 서버에 Request를 전달합니다.
배분 된 서버로부터의 response는 리버스 프록시를 통해
클라이언트로 전송되므로
리버스 프록시는 response를 gzip으로 압축하는 등의 궁리를 해 볼 수 있습니다.
응답 내용을 캐시 해두고 다음에 다시 리버스 프록시가 그것을 반환하거나,
SSL 통신의 맨 마지막을 리버스 프록시로 하는 것도 가능합니다.
이는 응답 시간 개선 및 백엔드 서버들의 부하가
경감되는 것을 기대할 수 있습니다.

# 로드 밸런서
로드 밸런서는 부하 분산을 목적으로 한 네트워크 장비입니다.
외부로부터의 요청을 동등한 기능을 가진 여러 서버에 전달합니다.
따라서 횡 방향으로의 스케일이 용이합니다.
어떤 서버로 배분할지 결정하는 방식으로는
차례대로 배분하는 방법이나 처리하는 connection의 수가 
적은 서버에 배분하는 방법 등이 있습니다.
장애 등에 의해 동작하지 않는 서버로 공급되는 것을 막기 위해,
정기적으로 health check를 실시하기도합니다.

# 리버스 프록시와 로드밸런서의 차이
통신 계층의 차이로,기본적으로 리버스 프록시는 L7 (Application Layer)
로드 밸런서는 L4 (Transport layer)이라는 차이가 있습니다.
L4까지의 정보에 따라 분류 할 경우,IP 주소와 포트 번호로 배분됩니다.
한편 L7의 경우는 HTTP 헤더의 내용 등으로 분류의 판정에 사용할 수 있습니다.
그러나 현재는 대부분의로드 밸런서가 L7을 지원하고 있습니다.
또한 역방향 프록시는 압축 등 통신 내용등을 수정할 수 있으면
캐시나 정적콘텐츠를 읽고 response를 반환 할 수 있지만,
로드 밸런서는 통신내용의 수정등은 하지 않습니다.

